0/epsilon
FoamFile
{
    format ascii;
    class  volScalarField;
    object epsilon;
}

dimensions [0 2 -3 0 0 0 0];

internalField uniform 0.0113201;

boundaryField
{
    freestream
    {
        type       inletOutlet;
        inletValue $internalField;
        value      $internalField;
    }

    "aircraft.*"
    {
        type  epsilonWallFunction;
        value $internalField;
    }

    "proc.*"
    {
        type processor;
    }
}

