0/nut
FoamFile
{
    format ascii;
    class  volScalarField;
    object nut;
}

dimensions [0 2 -1 0 0 0 0];

internalField uniform 0;

boundaryField
{
    freestream
    {
        type  calculated;
        value uniform 0;
    }

    "proc.*"
    {
        type processor;
    }

    "aircraft.*"
    {
        type  nutkWallFunction;
        value uniform 0;
    }
}
