constant/physicalProperties
FoamFile
{
    format ascii;
    class  dictionary;
    object physicalProperties;
}

viscosityModel constant;
nu             [0 2 -1 0 0 0 0] 1.48e-05;
