system/blockMeshDict
FoamFile
{
    format  ascii;
    class   dictionary;
    object  blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-20 -20 -20)
    (40 -20 -20)
    (40 20 -20)
    (-20 20 -20)

    (-20 -20 20)
    (40 -20 20)
    (40 20 20)
    (-20 20 20)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (8 8 8) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        inGroups (freestream);
        faces
        (
            (0 3 7 4)
        );
    }

    outlet
    {
        type patch;
        inGroups (freestream);
        faces
        (
            (1 5 6 2)
        );
    }

    others
    {
        type patch;
        inGroups (freestream);
        faces
        (
            (0 1 2 3)
            (0 4 5 1)
            (3 2 6 7)
            (4 7 6 5)
        );
    }
);
