system/controlDict
FoamFile
{
    format   ascii;
    class    dictionary;
    location "system";
    object   controlDict;
}

application foamRun;
solver      incompressibleFluid

startFrom startTime;
startTime 0;
stopAt    endTime;
endTime   5;

deltaT 0.01

writeFormat      binary;
writePrecision   6;
writeInterval    10;
writeCompression false;
timeFormat       general;
timePrecision    6;

runTimeModifiable false;
