system/decomposeParDict
FoamFile
{
    format ascii;
    class  dictionary;
    object decomposeParDict;
}

numberOfSubdomains 8;

method simple;

simpleCoeffs
{
    n (4 2 1);
}

