system/fvSchemes
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default       Gauss linear;

    limited       cellLimited Gauss linear 1;
    grad(U)       $limited;
    grad(k)       $limited;
    grad(epsilon) $limited;
}

divSchemes
{
    default          none;

    div(phi,U)       bounded Gauss linearUpwind limited;

    turbulence       bounded Gauss limitedLinear 1;
    div(phi,k)       $turbulence;
    div(phi,epsilon) $turbulence;

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default Gauss linear corrected;
}

interpolationSchemes
{
    default linear;
}

snGradSchemes
{
    default corrected;
}

wallDist
{
    method meshWave;
}
