system/fvSolution
FoamFile
{
    format  ascii;
    class   dictionary;
    object  fvSolution;
}

solvers
{
    p
    {
        solver    GAMG;
        tolerance 1e-7;
        relTol    0.1;
        smoother  GaussSeidel;
    }

    "(U|k|nut|epsilon)"
    {
        solver    smoothSolver;
        smoother  symGaussSeidel;
        tolerance 1e-6;
        relTol    0.1;
    }
}

SIMPLE
{
    // nCorrector               2
    nNonOrthogonalCorrectors 0;
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

relaxationFactors
{
    fields
    {
        p 0.3;
    }

    equations
    {
        "(U|k|epsilon)"   0.5;
    }
}
