system/snappyHexMeshDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       true;

mergeTolerance 1e-6;

geometry
{
    aircraft
    {
        type triSurfaceMesh;
        file "Sail_5.obj";
    }

    refinementBox
    {
        type searchableBox;
        min (-10 -3 -6);
        max ( 30  3  6);
    }
};

castellatedMeshControls
{
    maxLocalCells       1000000;
    maxGlobalCells      2000000;
    minRefinementCells  10;
    maxLoadUnbalance    0.10;
    nCellsBetweenLevels 3;
    refinementSurfaces
    {
        aircraft
        {
            level (6 8);
        }
    }

    refinementRegions
    {
        refinementBox
        {
            mode    inside;
            level   6;
        }
    }
    resolveFeatureAngle        30;
    insidePoint                (0 6 0);
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 3;
    tolerance    4.0;
    nSolveIter   30;
    nRelaxIter   5;

        // nFeatureSnapIter       10;
        // implicitFeatureSnap    false;
        // explicitFeatureSnap    true;
        // multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes true;
    layers
    {
        "aircraft.*"
        {
            nSurfaceLayers 1;
        }
    }
    expansionRatio            1.0;
    finalLayerThickness       0.3;
    minThickness              0.1;
    nGrow                     0;
    featureAngle              100;
    slipFeatureAngle          30;
    nRelaxIter                3;
    nSmoothSurfaceNormals     1;
    nSmoothNormals            3;
    nSmoothThickness          10;
    maxFaceThicknessRatio     0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle        90;
    nBufferCellsNoExtrude     0;
    nLayerIter                50;
}

meshQualityControls
{
    maxNonOrtho         65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave          80;
    minVol              -1e30;
    minTetQuality       1e-15;
    minTwist            0.02;
    minDeterminant      0.001;
    minFaceWeight       0.05;
    minVolRatio         0.01;
    nSmoothScale        4;
    errorReduction      0.75;
}
